# GetLayerTransparency

## Description
Return the tranparency of the current layer.

```pascal
FUNCTION GetLayerTransparency : REAL;
```

```python
def vs.GetLayerTransparency():
    return REAL
```

## See Also
VS Functions:
SetLayerTransparency

## Version
Availability: from Vectorworks 2013

## Category
* Layers